{
  "listings": [
    {
      "id": "1",
      "title": "17 Acres in Washington County, OH - Moss Road",
      "slug": "17-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Marietta",
      "acreage": 17,
      "price": 85000,
      "isNew": true,
      "shortDescription": "Prime 17-acre parcel on Moss Run Road in Washington County. Excellent hunting property with mixed hardwoods and easy access. Perfect for recreational land or future home site.",
      "overview": "This exceptional 17-acre tract on Moss Road offers an ideal opportunity for hunters and outdoor enthusiasts in Washington County, Ohio. The property features mature hardwoods providing excellent cover for deer and turkey, with natural topography creating ideal bedding areas and travel corridors.",
      "roadFrontage": "",
      "utilities": "Electric available at road",
      "parcelId": "",
      "youtubeUrl": "https://www.youtube.com/embed/NgT34_zNW-k?si=B-RwPx3ZVxe6O7MU",
      "mapEmbedHtml": "https://id.land/ranching/maps/76e6e7c7facd3792a865cfa6c2d2891f/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "2",
      "title": "160 Acres in Washington County, OH - State Route 26",
      "slug": "160-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Marietta",
      "acreage": 160,
      "price": 649900,
      "isNew": true,
      "shortDescription": "Impressive 160-acre tract with State Route 26 frontage in Washington County. Excellent timber value, abundant wildlife, and multiple use potential. A rare large acreage opportunity in southeast Ohio.",
      "overview": "This substantial 160-acre property along State Route 26 represents a premier land opportunity in Washington County, Ohio. With significant road frontage on a major state route, the property offers exceptional accessibility while maintaining the privacy and seclusion that serious land buyers demand. The acreage features mature timber stands with strong commercial value, rolling terrain ideal for wildlife management, and the size necessary for serious hunting operations. At 160 acres, the property provides sufficient scale for establishing food plots, creating sanctuary areas, and implementing comprehensive habitat improvements. The land's natural features support robust populations of whitetail deer, turkey, and small game. Beyond recreational use, this property offers flexibility for timber investment, potential development opportunities given its SR 26 frontage, or simply holding as a legacy asset. Properties of this size with paved road access are increasingly rare in Washington County, making this a noteworthy opportunity for investors, serious hunters, or those seeking a significant land holding in southeast Ohio. The combination of size, location, and natural resources makes this 160-acre tract a standout offering in the current market.",
      "roadFrontage": "",
      "utilities": "Electric available at road",
      "parcelId": "",
      "youtubeUrl": "https://www.youtube.com/embed/bInSAR1lCXU?si=hrqG1rjA8C0oAqux",
      "mapEmbedHtml": "https://id.land/ranching/maps/edba41aee196ef3fd6b29d60c28d4d39/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "3",
      "title": "25 Acres in Wood County, WV - Happy Hollow Road",
      "slug": "25-acres-wood-county-wv",
      "county": "Wood",
      "state": "WV",
      "nearestTown": "Parkersburg",
      "acreage": 25,
      "price": 250000,
      "isNew": true,
      "shortDescription": "Beautiful 25-acre woodland parcel on Happy Hollow Road in Wood County, West Virginia. Peaceful setting with excellent hunting potential and recreational opportunities in the heart of WV hill country.",
      "overview": "Discover the natural beauty of West Virginia on this pristine 25-acre tract along Happy Hollow Road in Wood County. This property embodies everything that makes West Virginia special - hardwood forests, rolling topography, and abundant wildlife in a peaceful rural setting. The 25-acre size is ideal for buyers seeking a manageable recreational property with serious hunting potential. The land's natural cover and terrain create excellent habitat for deer, turkey, and other game species. With good access via Happy Hollow Road, the property is easily accessible yet offers the seclusion that outdoor enthusiasts appreciate. This tract is perfectly suited for a hunting camp, weekend retreat, or future home site where you can enjoy West Virginia's outdoors year-round. The property's location in Wood County provides a good balance of remoteness and accessibility to larger towns and amenities. Whether you're looking to establish a family hunting tradition, create a private getaway, or invest in West Virginia timberland, this 25-acre parcel offers excellent value and versatility. The property is ready for your vision - from simple recreational use to more developed improvements.",
      "roadFrontage": "1085 ft",
      "utilities": "Electric, phone, rural water available",
      "parcelId": "",
      "youtubeUrl": "https://www.youtube.com/embed/1PQD8O2jQEM?si=S54FSgYcYp2yC1Z2",
      "mapEmbedHtml": "https://id.land/ranching/maps/67db8f08953083d11873ebdc500f1840/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "4",
      "title": "26 Acres in Wood County, WV - Happy Hollow Road",
      "slug": "26-acres-wood-county-wv",
      "county": "Wood",
      "state": "WV",
      "nearestTown": "Parkersburg",
      "acreage": 26,
      "price": 132900,
      "isNew": true,
      "shortDescription": "Quality 26-acre wooded tract on Happy Hollow Road in Wood County, WV. Excellent recreational land with mature timber, diverse wildlife habitat, and the seclusion of rural West Virginia hill country.",
      "overview": "This well-positioned 26-acre woodland tract on Happy Hollow Road represents an excellent opportunity to own quality recreational land in Wood County, West Virginia. The property features mature hardwood timber, natural terrain variations, and the peaceful rural character that defines this region. At 26 acres, the property provides sufficient space for hunting, trail development, and establishing a private outdoor retreat. The land's natural features support healthy populations of whitetail deer and wild turkey, while the wooded cover and topography create ideal conditions for wildlife movement and bedding areas. Multiple potential building sites exist for those interested in constructing a cabin or full-time residence. Located on Happy Hollow Road, the property offers practical access while maintaining the privacy and quiet that land buyers value. The surrounding area is characterized by similar rural holdings, ensuring your investment remains protected from unwanted development pressure. This tract is ideal for hunters seeking their own private ground, families wanting a recreational property to enjoy for generations, or investors recognizing the enduring value of West Virginia timberland. With its combination of accessibility, natural features, and manageable size, this 26-acre parcel represents a solid land investment in the Mountain State.",
      "roadFrontage": "575",
      "utilities": "Electric available",
      "parcelId": "",
      "youtubeUrl": "",
      "mapEmbedHtml": "https://id.land/ranching/maps/67db8f08953083d11873ebdc500f1840/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "5",
      "title": "19 Acres in Washington County, Ohio - Reed Road",
      "slug": "19-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Marietta",
      "acreage": 19,
      "price": 99340,
      "isNew": true,
      "shortDescription": "This 19.86-acre Washington County property offers a perfect blend of open fields and lush woods, providing an ideal setting for a secluded home site, hunting cabin, or recreational getaway. You'll enjoy stunning panoramic views and direct access to essential utilities, including electric at the road and future public water availability. Located just minutes from Marietta and the Ohio River, this versatile tract combines the peace of the countryside with convenient proximity to local amenities.",
      "overview": "19.868 acres for sale in Washington County, Ohio. If you have been looking for a new home site, cabin site, or recreational property, there is a tract for you! Call now while there are several to choose from! Tracts are close to Marietta, the Ohio River, and I-77. The property is located in the Frontier Local School District. The seller is reserving any mineral, gas, and oil rights. Annual taxes are to be determined due to new splits. A new survey has been completed.",
      "roadFrontage": "1886 ft",
      "utilities": "Electric at the road",
      "parcelId": "",
      "youtubeUrl": "https://www.youtube.com/embed/7xp4TQ2lk_4?si=1zFwdU1Q28C0H7Bb",
      "mapEmbedHtml": "https://id.land/ranching/maps/76e6e7c7facd3792a865cfa6c2d2891f/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "6",
      "title": "49 Acres in Washington County, Ohio - Zion Road",
      "slug": "49-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Marietta",
      "acreage": 49,
      "price": 220900,
      "isNew": true,
      "shortDescription": "This 49-acre Washington County property features a premier hilltop build site with panoramic views of lush ridges and deep ravines, ideal for your dream cabin. Directly bordering the Wayne National Forest, this mostly wooded tract offers exceptional hunting for deer and turkey along with an established trail system for easy exploration.",
      "overview": "If you have been searching for the ultimate escape to the great outdoors, this 49-acre Washington County tract is the opportunity you've been waiting for. Priced at $220,900, this property offers a rare combination of absolute privacy, rugged natural beauty, and direct access to public land. Key Highlights of Tract 19: The Perfect Build Site: Perched at an elevation of over 1,000 feet, the premier hilltop site offers breathtaking panoramic views of high ridges and deep ravines—the perfect backdrop for a secluded log cabin or weekend retreat. A Hunter's Paradise: Bordering the Wayne National Forest directly on its eastern boundary, this land provides a seamless transition into thousands of acres of additional territory. The \"big woods\" habitat is teeming with whitetail deer, turkey, and small game. Ready to Explore: With 3,144 feet of frontage on a paved road and an established trail system winding through the older timber, the property is remarkably accessible for hiking, ATV riding, or reaching your favorite hunting blind. Whether you are looking to invest in timber, establish a basecamp for your outdoor adventures, or build a legacy home in the Frontier Local School District, Zion Ridge Tract 19 is a versatile canvas ready for your vision.",
      "roadFrontage": "3144",
      "utilities": "",
      "parcelId": "",
      "youtubeUrl": "",
      "mapEmbedHtml": "https://id.land/ranching/maps/8eb2134ee064dfd975bf08b59b38451b/share",
      "createdAt": "2026-01-15"
    },
    {
      "id": "7",
      "title": "Brooks Rd Lot 1 - 128 Acres in Washington County, OH",
      "slug": "128-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Reno",
      "acreage": 128,
      "price": 349900,
      "isNew": true,
      "shortDescription": "Exceptional 128-acre woodland retreat in Washington County offering ultimate privacy off a quiet gravel road. Bordering Wayne National Forest with direct access to trophy muskie fishing on the Little Muskingum River, this is a true outdoorsman's paradise.",
      "overview": "Own 128 acres of pristine Appalachian wilderness in Washington County, Ohio. Tucked away off a quiet gravel road in Lawrence Township, this property delivers the kind of seclusion most landowners only dream of—minimal road traffic and neighbors few and far between. The location transforms this from a simple land purchase into a gateway for endless outdoor adventures. With direct access to hundreds of acres of Wayne National Forest, you'll enjoy unlimited hiking, exploring, and wildlife observation right from your doorstep. The nearby Little Muskingum River is renowned for trophy muskie and exceptional smallmouth bass fishing. Hunters will find abundant whitetail deer, wild turkey, and small game throughout the heavily wooded terrain, with vast surrounding public lands extending your hunting grounds exponentially. Whether you envision building a secluded cabin retreat, establishing a family hunting camp, or preserving your own piece of wilderness, this property delivers on every front.",
      "roadFrontage": "",
      "utilities": "Well/septic needed",
      "parcelId": "",
      "youtubeUrl": "",
      "mapEmbedHtml": "",
      "createdAt": "2026-01-18"
    },
    {
      "id": "8",
      "title": "Brooks Rd Lot 3 - 34 Acres in Washington County, OH",
      "slug": "34-acres-washington-county-oh",
      "county": "Washington",
      "state": "OH",
      "nearestTown": "Reno",
      "acreage": 34,
      "price": 135900,
      "isNew": true,
      "shortDescription": "Secluded 34-acre wooded retreat in Washington County featuring established trails and a completed select timber harvest. Borders Wayne National Forest for expanded hunting and recreation opportunities.",
      "overview": "Discover the perfect canvas for your private retreat—34 acres of secluded woodland in Washington County, Ohio. This remarkable property offers an outstanding combination of size, location, and natural beauty for those seeking their own escape from everyday life. The land features an extensive network of trails and roads throughout the acreage, providing easy access to every corner from day one. Previous owners completed a select timber harvest, resulting in a well-managed woodland that promotes healthy forest growth while maintaining the natural character of the landscape—ready for your enjoyment without extensive initial work. Bordering Wayne National Forest instantly expands your recreational options to include hundreds of acres of public land for hiking, exploring, and hunting. The surrounding area is a true hunting paradise teeming with whitetail deer, wild turkey, and abundant small game. The remote setting off a quiet gravel road ensures minimal disturbance, creating an ideal environment for wildlife observation and outdoor pursuits.",
      "roadFrontage": "",
      "utilities": "Well/septic needed",
      "parcelId": "",
      "youtubeUrl": "",
      "mapEmbedHtml": "",
      "createdAt": "2026-01-18"
    }
  ]
}

